OpenFOAM-folder/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 0.001;
    }
    domain_walls
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
    domain_valley
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
    west1
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
    east1
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
    DamBaffle
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
    cyclic
    {
        type            cyclic;
    }
}


// ************************************************************************* //
