OpenFOAM-folder/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-07;

boundaryField
{
    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }
    domain_walls
    {
        type            nutkRoughWallFunction;
        Ks              uniform 4.826809;     
        Cs              uniform 0.5;          
        value           uniform 1;
    }
    domain_valley
    {
        type            nutkRoughWallFunction;
        Ks              uniform 4.826809;     
        Cs              uniform 0.5;          
        value           uniform 1;
    }
    west1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    east1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    DamBaffle 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    cyclic
    {
        type            cyclic;
    }
}


// ************************************************************************* //
