OpenFOAM-folder/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    domain_walls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    domain_valley
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    west1 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    east1 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    DamBaffle 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }
    baffle_master
    {
        type            cyclic;
    }
    baffle_slave
    {
        type            cyclic;
    }
    cyclic
    {
        type            cyclic;
    }
}


// ************************************************************************* //
