OpenFOAM-folder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices  
(
    ( 0 0 -1500)
    ( 154775 0 -1500)
    ( 154775 164888 -1500)
    ( 0 164888 -1500)
    ( 0 0 7500)
    ( 154775 0 7500)
    ( 154775 164888 7500)
    ( 0 164888 7500)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (240 260 14)  simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    east
    {
    	type 		wall;
    	faces 
    	(
        	(1 2 6 5)
    	);
    }
    bottom 
    {
    	type 		wall;
    	faces 
    	(
        	(0 3 2 1)
    	);
    }
    west 
    {
    	type 		wall;
    	faces 
    	(
        	(0 4 7 3)
    	);
    }
    atmosphere 
    {
    	type 		patch;
    	faces 
    	(
        	(4 7 6 5)
    	);
    }
    south
    {
    	type 		wall;
    	faces 
    	(
        	(0 4 5 1)
    	);
    }
    north 
    {
    	type 		wall;
    	faces 
    	(
        	(2 3 7 6)
    	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
