OpenFOAM-folder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libmyBaffleVelocity");

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         7500;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval         500;

purgeWrite      0;

writeFormat           ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.9;
maxAlphaCo      0.9;

maxDeltaT       1;

functions 
{
  outletMassFlowYourPatch
   {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;
        log             true;
        writeFields     false;
        regionType      patch;
        name            baffle_master;
        operation       sum;
        fields
        (
            phi
        );
   }
}


// ************************************************************************* //
