OpenFOAM-folder/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    west
    {
        type        searchableSurface;
        surface     plate;
        origin      (120958 120356 4442);
        span        (0 100 90);

    patches
        {
            master
            {
                name            west1;
                type            wall;
                neighbourPatch  west2;
                patchFields
                {
                    p_rgh
                    {
                        type            fixedFluxPressure;
                        value           0;
                    }
                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }   
                }
            }
            slave
            {
                name            west1;
                type            wall;
                neighbourPatch  west2;
                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }
}

baffles
{
    east
    {
        type        searchableSurface;
        surface     plate;
        origin      (120958 120545 4442);
        span        (0 100 90);

    patches
        {
            master
            {
                name            east1;
                type            wall;
                neighbourPatch  east2;
                patchFields
                {
                    p_rgh
                    {
                        type            fixedFluxPressure;
                        value           0;
                    }
                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }   
                }
            }
            slave
            {
                name            east1;
                type            wall;
                neighbourPatch  east2;
                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }
}

baffles
{
    quadruplicateBaffle
    {
        type        faceZone;
        zoneName    baffleFaceZone;
        patches
        {
            baffle_master_cyclic
            {
                name            baffle_master;
                type            cyclic;
                sampleMode      nearestPatchFace;
                neighbourPatch  baffle_slave;
                sameGroup       off;
                patchFields
                {
                }
            }
            
            baffle_slave_cyclic 
            { 
                name            baffle_slave;
                type            cyclic;
                sampleMode      nearestPatchFace;
                neighbourPatch  baffle_master;
                sameGroup       off;
                patchFields
                {
                } 
            }
            
            baffle_master_wall
            {
                name            baffleWall1;
                type            wall;
            }
            baffle_slave_wall
            {
                name            baffleWall2;
                type            wall;
            }
        }
    }
}   

// ************************************************************************* //
